data/sysbench/ext4/rndrw/20G/nvme0n1thread1
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: 0
128 files, 160MiB each
20GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      13085.58
    writes/s:                     8723.73
    fsyncs/s:                     8723.73

Throughput:
    read, MiB/s:                  204.46
    written, MiB/s:               136.31

General statistics:
    total time:                          60.0001s
    total number of events:              1308647

Latency (ms):
         min:                                  0.00
         avg:                                  0.05
         max:                                  4.17
         95th percentile:                      0.11
         sum:                              59199.10

Threads fairness:
    events (avg/stddev):           1308647.0000/0.00
    execution time (avg/stddev):   59.1991/0.00