data/sysbench/ext4/rndrw/20G/nvme0n1thread20
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 20
Initializing random number generator from current time


Extra file open flags: 0
128 files, 160MiB each
20GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      94535.99
    writes/s:                     63024.16
    fsyncs/s:                     63024.16

Throughput:
    read, MiB/s:                  1477.12
    written, MiB/s:               984.75

General statistics:
    total time:                          60.0002s
    total number of events:              9454248

Latency (ms):
         min:                                  0.00
         avg:                                  0.10
         max:                                  4.31
         95th percentile:                      0.39
         sum:                             987041.51

Threads fairness:
    events (avg/stddev):           472712.4000/169858.39
    execution time (avg/stddev):   49.3521/16.02