data/sysbench/ext4/rndrw/20G/sdb1thread40
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 40
Initializing random number generator from current time


Extra file open flags: 0
128 files, 160MiB each
20GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      192.70
    writes/s:                     128.96
    fsyncs/s:                     128.96

Throughput:
    read, MiB/s:                  3.01
    written, MiB/s:               2.01

General statistics:
    total time:                          60.1792s
    total number of events:              19358

Latency (ms):
         min:                                  0.01
         avg:                                124.24
         max:                                541.72
         95th percentile:                    331.91
         sum:                            2404966.36

Threads fairness:
    events (avg/stddev):           483.9500/53.47
    execution time (avg/stddev):   60.1242/0.01