data/sysbench/ext4/rndrw/20G/sdc1thread50
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Extra file open flags: 0
128 files, 160MiB each
20GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      4676.16
    writes/s:                     3118.10
    fsyncs/s:                     3118.10

Throughput:
    read, MiB/s:                  73.07
    written, MiB/s:               48.72

General statistics:
    total time:                          60.0103s
    total number of events:              467763

Latency (ms):
         min:                                  0.01
         avg:                                  6.40
         max:                                 42.44
         95th percentile:                     20.74
         sum:                            2994261.09

Threads fairness:
    events (avg/stddev):           9355.2600/432.77
    execution time (avg/stddev):   59.8852/0.01