data/sysbench/ext4/rndrw/20G/sdd1thread20
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 20
Initializing random number generator from current time


Extra file open flags: 0
128 files, 160MiB each
20GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      4278.94
    writes/s:                     2852.91
    fsyncs/s:                     2852.91

Throughput:
    read, MiB/s:                  66.86
    written, MiB/s:               44.58

General statistics:
    total time:                          60.0031s
    total number of events:              427957

Latency (ms):
         min:                                  0.01
         avg:                                  2.80
         max:                                 29.07
         95th percentile:                     10.46
         sum:                            1197088.08

Threads fairness:
    events (avg/stddev):           21397.8500/410.50
    execution time (avg/stddev):   59.8544/0.00